// src/constants/tags.ts

export const criticalTags = [
    "순애","빈유","거유","정상위","후배위","기승위","파이즈리","대딸","펠라","질싸(질내사정)","얼싸"
];

export const expandedTags: Record<string, string[]> = {
    "형식":["망가","단행본","이미지","단편","웹툰","웹소설","AI","무검열"],
    "장르":["순애","NTR","판타지","현대","SF"],
    "여주":["처녀","친누나","사촌누나","의붓누나","친한 누나","친동생♀","사촌동생♀","의붓여동생","친한 동생♀","친엄마","의붓엄마","아는 어머님","친딸","의붓딸","손녀","직장후배♀","직장선배♀","직장상사♀","학교후배♀","학교선배♀","선생님♀","닭장","30대♀","20대♀","대학생♀","고등학생♀","중학생♀","초등학생♀","유치원생♀","이모/고모","여친","전여친","아내","전처","과부","이혼녀","본인♀","메이드","노예♀","주인♀","귀족♀","재벌♀","종업원♀","고용주♀","고용인♀","외계인♀","인형♀","갸루♀","일진♀","동양인♀","서양인♀","흑인♀","수인♀","퍼리♀","동물♀","식물♀","드래곤♀","요정♀","악마♀","천사♀","마왕♀","엘프♀","서큐버스♀","촉수♀","점액♀","ASFR♀","투명인간♀","초능력자♀","용사♀","고블린♀","오니♀","몬스터♀","벌레♀","뱀파이어♀","좀비♀"],
    "남주":["동정","친오빠","사촌오빠","의붓오빠","아는 형님","친동생♂","사촌동생♂","의붓남동생","친한 동생♂","친아빠","의붓아빠","아는 아버님","친아들","의붓아들","할아버지","직장후배♂","직장선배♂","직장상사♂","학교후배♂","학교선배♂","선생님♂","중년/노년","30대♂","20대♂","대학생♂","고등학생♂","중학생♂","초등학생♂","유치원생♂","삼촌/이모부","남친","전남친","남편","전부","홀아비","이혼남","본인♂","집사","노예♂","주인♂","귀족♂","재벌♂","종업원♂","고용주♂","고용인♂","외계인♂","인형♂","갸루♂","일진♂","동양인♂","서양인♂","흑인♂","수인♂","퍼리♂","동물♂","식물♂","드래곤♂","요정♂","악마♂","천사♂","마왕♂","엘프♂","서큐버스♂","촉수♂","점액♂","ASFR♂","투명인간♂","초능력자♂","용사♂","고블린♂","오니♂","몬스터♂","벌레♂","뱀파이어♂","좀비♂"],
    "관계":["타인","지인","같은 학교","같은 반","근친","남매","부녀","모자","쌍둥이","근처에 거주","우월♂","우월♀","수평관계"],
    "성격♀":["무표정","톰보이","데레데레","나데나데","순종적","반항적"],
    "인원":["남1 여1","남1 여2","남2 여1","남1 여다수","남다수 여1"],
    "의상":["교복","세일러복","코스프레","레이스","승부속옷","브루마","스쿨미즈","수영복","가슴붕대","마에바리","니플패치","가터벨트","무녀옷","간호사복","에이프런","붕대","바디슈트","웨딩드레스","정장","스패츠","핫팬츠","정조대","기저귀","직원복","집사복","메이드복","저지","치어리더복","치파오","코르셋","고스로리","하이레그","닌자복","연구 가운","라텍스","레오타드","속옷","마법소녀옷","갑옷","기계부품","부츠","하이힐","경찰복","란도셀","스튜어디스복","핸드백","마녀/마법사 로브","원피스","수녀복","타이즈","바니걸","와이셔츠","오버핏 셔츠","후드티","젖음","노출"],
    "머리/악세사리":["담배","안경","안대","실눈","역안","하트눈","선글라스","코걸이","귀걸이","특수동공","숏컷","포니테일","트윈테일","드릴머리","경단머리","장발","쵸커","꼬리형 애널플러그","유두 피어싱","배꼽 피어싱","혀 피어싱","머리띠","머리끈","점"],
    "신체":["구체관절","날개","뿔","동물귀","꼬리","흉터","주근깨","장신♀","장신♂","단신♀","단신♂","BBW","BBS"],
    "에로사항":["빈유","거유","폭유","유두","함몰유두","유륜","흑두","보지털","자지털","디지털","겨털","처녀막 파열"],
    "페티시":["발","심장박동(카디오필리아)","긴혀","송곳니","상어이빨","겨드랑이","복부융기","대물","소추","문신","음문","낙서","썬탠 라인"],
    "상황":["리드♂","리드♀","첫경험","연애","섹파","불륜","협박","매춘","시간정지","우연찮은임신","아기만들기","녹화","육변기","오야코동","착의 섹스","판치라","글로리홀","몸바꾸기","섹못방","폴리네시안 섹스"],
    "장소":["방♀","방♂","모텔/호텔","야외 섹스","폰섹스","카섹스","마일하이클럽","교실","온천/목욕탕","수영장","바다","공공장소","샤워실","욕조","학교","거실","소파","침대","바닥","벽"],
    "시간":["모닝 섹스","정오","저녁","자정","새벽"],
    "체위":["정상위","굴곡위","신장위","프론본(복위)","후배위","기승위","좌위","측위","입위","들박","풀넬슨","다이슈키 홀드","벽 끼임(카베시리)","손잡이"],
    "애무":["전희","후희","대딸","펠라","청소펠라","딥 스로트","커닐링구스","69","스마타","풋잡","파이즈리","후까시(애닐링구스)","비비기","키스마크","부랄 애무","오금 애무","몸 키스/핥기","발 핥기","착유"],
    "자위":["모서리 자위","바닥딸","상상딸","요도 자위","폭딸","항문자위"],
    "기구":["딜도","애널 플러그","애널 비즈","바이브레이터","로터","아네로스","오나홀","섹스머신","이물질","러브젤","오일"],
    "삽입/절정":["넣어줘♥","넣을게...","뜸들이기","노콘","항문 성교","질싸(질내사정)","체외사정","연속 사정","크림파이","얼싸","입싸","꿀꺽♥(곳쿤)","아헤가오","시오후키"],
    "분비물":["침","땀","냄새","모유(락토필리아)","메노필리아(생리혈)"],
    "멀티플레이":["난교","갱뱅","역갱뱅","3P","다중 삽입","트윈 푸씨잡","붓카케"],
    "야바위":["NTR","NTL","NTS","역NTR","역NTL","역NTS","스와핑"],
    "성소수자":["TS♀","TS♂","후타나리","백합","가위치기","페깅","BL","프롯"],
    "이상성욕: 연령":["로리","약로리","쇼타","유아퇴행(오토네피오필리아)","할카스(제론토필리아)"],
    "이상성욕: 상태":["솜노필리아(잠듦)","MC(최면)","스펙트로필리아(귀신)","마이에지오필리아(임산부)","네크로필리아(시체)","탈장","신체개조","감각공유"],
    "이상성욕: 대상":["메카노필리아(기계)","마크로필리아(거인)"],
    "이상성욕: 행위":["트랜스베스토필리아(이성의 옷을 입음)","산란"],
    "BDSM":["조교","강간(바이스토필리아)","윤간","펨돔","볼버스팅","스팽킹","간지럼","피스팅","밟힘","코박죽","수치플","야외 노출","노출증","섹트","관음","골든 샤워","정신 붕괴","채찍","재갈","목줄","속박","구속"],
    "이상성욕: 폭력성":["브랫","료나","배빵","고어","아크로토모필리아(신체 절단)","아포템노필리아(자기 신체 절단)","보어(잡아먹힘)","약물","니플퍽","경련","기생충"],
    "인외":["퍼리","수간","충간"],
    "배설":["스카톨로지","인격배설"]
};